{"podcast_details": {"podcast_title": "The Daily", "episode_title": "How a Paradise Became a Death Trap", "episode_image": "https://image.simplecastcdn.com/images/03d8b493-87fc-4bd1-931f-8a8e9b945d8a/2cce5659-f647-4366-b318-46e4b67afcfa/3000x3000/c81936f538106550b804e7e4fe2c236319bab7fba37941a6e8f7e5c3d3048b88fc5b2182fb790f7d446bdc820406456c94287f245db89d8656c105d5511ec3de.jpeg?aid=rss_feed", "episode_transcript": " From the New York Times, I'm Sabrina Tavernisi, and this is The Daily. On Monday, we heard the story of Waiole Church and what was lost in the wildfires on Maui. What we didn't know then was the sheer scale of the catastrophe, what it felt like to experience it, and how it could be that so many people died. One hundred and eleven in the latest count. Today, the miraculous story of one man who survived. And my colleague in Hawaii, Mike Baker, on how an extraordinary set of circumstances came together to turn Lahaina into a death trap. It's Friday, August 18th. Hello? Hi, is this Idris? Yes it is. Hi. Idris, thank you for taking the time to talk to us. I wonder, Idris, if you could introduce yourself for me. Tell me your name, your age, where you live, and what your profession is. My name is Idris Noara. I'm 32 years old. I lived on Prison Street in Maui, Lahaina. And I was the manager of a Hilton property at the beach and pool, working sales. Got it. And I wonder if you could start by telling us, just kind of from the beginning, how your day started. So actually it was my first true day off in a long time. And I woke up in the middle of the night, which was Monday night, Tuesday morning, around three or four a.m. when we lost power. So it got pretty hot. So I opened up the windows, and by the time I woke up around six, seven a.m., I noticed we didn't have service neither. No more front service, no power. It was very windy. So I texted the front desk manager to ask him about my staff. I wanted to make sure they were safe. And they told me that they were keeping the pool open. And honestly, I was just annoyed. I was like, I've been waiting for this day off forever, and no power, it's windy. And I was like kind of complaining. No one knew that it was going to get to that point. We didn't even know it was a hurricane. We just thought it was windy. So I went on my day and put up the cabinets in my bathroom. And then I started reading my Kindle. And that was pretty much just one of those days. And were you aware of the fire at that point? Absolutely not. There was no fire in the morning that I was aware of. We had no warnings at all. And so I think it was around noon or 1, one of my neighbors came in, knocked on my door and he said, hey, you need to come out and see this. So I came out and in front of my house, I have a little cottage. Behind my house, I could see a lot of smoke. And it was kind of far, maybe like a mile, maybe a little less than a mile away. And it was a lot of smoke. It was a black smoke. I go, something's burning. And all our neighbors were meeting. They were talking about an escape plan. And I said, you know, it's kind of far away. We have scooters and bikes and I don't think it's safe to be on the road anyways. You know, we'll be safer in our homes. You know, so I call my cat as an outdoor cat and I call her and I couldn't find her all day. And then I just gave up and I went home and I closed my door. And then my neighbor came back maybe an hour later and he said, there's another fire. And it was closer. It's actually the street behind us. And I have a scooter. So I actually went to go check out how close the fire was. And it was pretty close, but still kind of far away. It was in front of an apartment complex. And right across from that, there was another house and there were bushes that were starting to catch on fire. So I parked my scooter and I ran into the yard and I was looking for the neighbors to ask them for their hose because I wanted to like, it was small enough to like put down. And so I saw the neighbors, they were already in their car in the driveway. So I knocked on the window and the guy didn't even say, he didn't even respond. I don't remember him responding. And by the time I went back in the garden to find the hose, another guy saw it and grabbed it and we were like pulling down the fire in his bushes. And after that, I got on Front Street, which is a street that goes along the ocean. And I see there's this restaurant up in flames. And I'm like, okay, what's going on? How is this big? It just didn't make sense. It didn't make sense. So I couldn't go through. There was so much smoke and fire. What time is it at that point Idris? What time is it? I think it's like 2.30. It had to be 2 or 2.30, something like that. And I remember seeing like a white SUV and this Asian woman was trying to cut in line. She could even cut in line. Clearly she was panicking. And I saw people running and straight in front of me, there's a medical center. And I remember actually seeing a line of people trying to get into the medical center. They were all staying in front of me. And there's a big parking lot. So they were taking shelter in it. It was pretty bad. It was pretty bad. I was on Front Street. And so I made a right. I turned my head and behind me. There's a whole business on fire. It's like, holy, like, like what's going on? Everything was on fire. Like I didn't understand how things start to catch on fire. It didn't make sense. And now I start to panic. So I went back to the neighbors, but the neighbors were all gone. Idris, what did you think at that moment when you came back to your house and the neighbors were all gone? I felt kind of lost. And the wind, there was wind and it was trees falling down. And I screamed for my cat and I saw her run under the house and she didn't want to come out. So I was panicking. Reality started to set in. And so I said, okay, maybe the safest place to be right now is here because I wouldn't even know where to go. And so I'm closing the door and about five minutes, everything turned black outside. And so I opened the curtain and I saw that medical center across the street was up in flame to the sky. And I couldn't understand how, like I just saw people, like it was, there was nothing like five, 10 minutes ago. And it really looked like someone put gasoline all over the building and he just like took up and flame. It didn't make sense how like a stone building could burn so fast. And so I opened the door, still calling my cat and I felt something burning on my shoulder and it was debris like amber. And I look up in the sky and there's a very fire coming down the sky. It was raining fire. And now I said, I have to get out of here. What time was that Idris? About three o'clock I'd say. I noticed that the neighbors had turned all the hose and got everything wet. So I took one of the hose and got my doorway and trying to, we still thought that we could prevent anything from happening. And so I got everything I could, all the necessities, clothes and wallet and pictures or whatever and put everything in two big bags. And I ran out of the house and as I ran out of the house, there was smoke everywhere. And I saw one of my neighbors coughing. He's right in front of the house, in front of the street. And he was just coughing. And I said, what are you doing here? He's like, oh, I went to the store and I said, okay, let's get on my scooter. So he came behind me on my scooter and the fire came from uphill. It was coming down. So to me, the safest place of this fire is water. And so in the panic, I said, we have to go to the harbor. And then I couldn't even get on Prison Street because there was a power line that was down. It was moving so fast with the wind and it was so much smoke. So I went in the parking lot across where the medical center was burning and where it was full of smoke. And I almost hit a car that was parked but it was on. I saw it with the brake lights and there was a door open and this tall Hawaiian man came out and he was just waving his arms and he was screaming. I didn't know what he was saying. He was clearly speaking English, but he was just panicked. I don't remember. I just remember his face, his eyes and his eyebrows were just raised up to the max. Like I said, he was just speaking gibberish to me. And there was so much noise outside, the wind and the explosions. And I didn't know what he was saying. There was no way he could get on the scooter with us. And then I tried to get out of the parking lot and we got stuck on one of the curb. And I told Damon, which was my neighbor, get up and we pushed the scooter back up. He got back on and then we got on to Front Street. And on Front Street, I was just chaos. I could hear screams. And then I can see people, but I could hear them scream, scary screams, screams of pain I've never heard before. There were clearly people burning alive. Like it was a deep pain, you know, and people throwing up and it was just, it was horrifying. It was horrifying to hear that. I'm so glad I can see it was so it was black because there's so much smoke, but we could clearly hear them all around us, all around us. It felt like we were in hell. The wind itself, the wind was the scariest thing. The wind was so hot. It was burning our skin. It was so strong because everything was on fire. It was just, it felt like someone was pressing a blow dryer on your skin. And I told Damon, listen, I can't see anything. You got to tell me when to turn to the harbor because I can't see nothing. And so we finally got to the harbor and I left my scooter there and is a, at the edge of the water on the harbor, there's a little, little house, little, it's called the harbor master's hut. And it's where people come in by the tickets for the ferry. It's a little brick house, very small. And we go and we go in front of it. So we had our back against the wall and we were facing the ocean and we're just waiting. We just didn't know what to do. Did you say anything to him? No, we were not talking. We didn't know. I mean, in my mind, I'm like, okay, we're going to wait here. At least this water, which was crazy by the way, you know, so windy and at least like we're not going to burn. That's what I was thinking. But a couple minutes waiting there, I saw a shadow just run and jump in the water on the side of the house. And I said, Damon, do you see this? And we looked in the water, there's a big kid bull just drowning in front of us. And that's really when like it felt like the beginning of a movie, like a horror movie, you know, he must have been very scared to do that. Because he clearly didn't know how to swim. And you know, the paper was so intimidating, you know, he had the big head and yellow eyes and I didn't know I want to help him. But I didn't know if he was going to bite me or pull him with him in the water. You know, so I kept calling him and calling him but he couldn't do it. He tried his best to do it, but he couldn't do it. And his head kept going underwater and he kept coming up and it was always less and less. And I'll never forget the look he gave me in his eyes. He just gave up and his head went underwater. And I told Damon to hold my feet. And I took my shirt off and I somehow managed to grab it by the collar and pull him out. And we just we gave him water and we tried to calm him down. He was just walking in circles. He was trying to leave but every time he walked on the edge of the house, the wind was so hot he would just turn around and come back. So I tried to calm him down. He would sit next to me and he would sit next to Damon. He was in panic mode, you know, and we're talking to him. And then I called the police and I said, hey, we're on the harbor. We're stuck. You guys have to come get us. And the lady was just, she didn't know what to say. She said, I'm sorry, we can't come get you. Everything was in flames and they were overwhelmed. I hung up, you know. And I just remember seeing debris falling from the sky and our bags kept catching on fire. So we kept trying to remove debris on ourselves every time it fell on our skin, you know, trying not to burn. What time was that approximately? I think it was about maybe four o'clock at this point. Miraculously, I saw on my phone, I had one bar of service. So I tried to call my best friend, Yacine, and I told my best friend, hey, I love you. Tell everybody I love them. It's going to be okay. You know, here's my mom's number. Don't call her now. Wait, you know, let her sleep and then tell her tomorrow we don't have service and I'm fine. I don't want her to wake up and see the news and, you know, panic. So he was confused. Like, what's going on? What do you mean? You know? Were you preparing because you thought you might not make it? Oh, yeah. We didn't think we were going to make it. I looked up in the sky and I said, God, please not today. Not like this. And I said, God, I'm sorry for everything and I want to be better. And I think I was going to make it. And after I hung up with him, I called the police again and she gave me the same answer. She said, I'm so sorry. And, you know, I could feel the frustration in her voice. She would just help if she didn't know. And I felt so bad for her because she probably had so many calls like this. And so I hung up again and I was just frustrated. So at this point, I thought maybe I could get into the harbor mess with her, the little house. Damon had a knife with him and he cut the screen off and I started punching the window with all my strength, all my strength until I fractured my hand. The window was so thick, it wouldn't even do anything. And so I called the police a third time and I said, if you guys don't come right now, we're going to die. And she said, you guys have to jump in the water. And I said, no way. You want us to jump in a hurricane at night? Like with all this smoke? Like there's no way we can jump. The water was crazy. And she said, you have no choice. You have to jump in the water. And I hung up and I looked at Damon and was like, we have to jump. And Damon said, there's no way I'm jumping. I'm not jumping. And I told him, listen, either we burn or we drown. And you know, I waited a couple more minutes. I tried to convince him and I said, you know, I'm jumping. There are rocks maybe 100 feet away or 150 feet. I'm not really good with distance, but you know, like a jetty. And I decided to make for it. And I tried my best, but you know, I was breathing smoke the whole time and you were swimming, you're going nowhere. You're fighting waves like the ocean. You can't do anything. I'm not like the best swimmer. And I finally made it. And I looked back and I screamed at Damon and he was just terrified. He was not, you know, he was next to the dog and I told him jump and I kept screaming and he just didn't want to. And so on the other side of the jetty, I saw three surfers sitting down with a surfboard on their back. And I said, I have to ask him for a surfboard to go and get my friend. And they said, there's no way. The wind is burning our skin. So they were using the surfboard as a shield. Even though we're in the middle of the water, the wind was still that hot. So I went back to the beginning of the rocks, right? I started and I could see him hanging on to the Harbor with half his body in the water. And I kept screaming, you need to let go. You need to let go. And he screamed, my shoes are too heavy. And so at this time I just made the decision to jump and go get him. So I got back in the water and I got back next to him. I tried to go and take his shoes off, but I can't even find his feet. The ocean was just pushing me against the wall. And I told him, you have to follow me. So I turned back around to the jetty and I was trying to stay on the water as much as I could because the wind was so hot. But every time I came up, like I was just bringing smoke. I mean, I was just bringing smoke for like the whole time. So I got back on the jetty for the second time and I see he jumped in the water and he's trying to make his way to us. And the way he was swimming, I said, there's no way he's going to make it. He was just struggling, just swallowing water and coughing. And somehow he managed to get very close to the rock and I pulled him up. You know, it was a miracle that he made it. You know, he's overweight and he's older. It was a miracle. And we still had debris falling on us and we had waves just coming over us. We were holding onto the rocks to not like get pulled or sucked in by the ocean. It was just a nightmare. What time was that? I don't know. Maybe like 530. I don't remember. It was nighttime. I mean, it looked like nighttime at least. And then I heard a dog screaming. So I was like, I have to go back and I jumped back in the water. You know, I tried to get back on the harbor. I got up and the dog didn't want to move. He was just too freaked out. He was laying against the wall, his eyes closed and just screaming. There's no way I could care. It was a big pit bull and I had one, you know, my hand was fractured or broken. I thought if I try to grab him in the water, he's already freaked out. We're both going to drown. You know, he's going to die for sure. And I'm probably not going to make it. So one of my bags, I had a blanket, like a small blanket, like for my sofa. And I dipped it in the ocean five or six times and I put it on top of the dog. That's all I could do. And I took one of my bags and I jumped back in the ocean. And then I almost drowned. I was just so exhausted and I panicked halfway. And I was praying to God, please help me. And I thank God I made it to the jetty and I went back on the other side. And I talked to Damon and he was not answering. And I grabbed his hand and he just held my hand. He was just in shock. He wasn't saying anything. And so I was holding Damon's hand for about a couple of hours. And it felt like the wind calmed down. And I remember I was grabbing Damon's hand and I say, oh, the wind kind of can't calm down. And as soon as I said that, everything lit up and I turned around and I saw a line of boats on fire coming towards us. And I remember saying to Damon, you got to be kidding me. All the boats that were tied to the harbor, all the ropes burned down and they were following the current back to sea. And they're all following each other on a perfect line. You would think that someone was on the boat steering them. Crazy. I had to tell Damon, you're seeing this, right? And he's like, yeah. And they were getting really close to us, almost circling us. You feel the heat and then they were exploding. And thank God they followed the current out to sea. They went straight out instead of going all the way around. And then maybe an hour after that, I saw light at far away. And I told Damon, I said, hey, I think there's a boat over there. And we were like screaming. I was screaming at the top of my lungs. And they were like coming towards us. I was like, thank God. Oh my God. I was screaming so hard. And the surfer was screaming and it was the Coast Guard. And they were like, we can't get close. You guys have to jump in the water. Because it was so rough. They were crashing the rocks. And then out of nowhere, there's a couple that were standing in front of the harbor and they had no clothes. They only had shorts and swimming suits. And that guy who had shorts, he was just red, like he was just burnt from the wind. I could see even from there, he was all red. And I kept screaming, jump in the water, jump in the water. But I don't think he was just processing anything. So the Coast Guards came and got him. And then they came to us last. And I jumped first. And they got me in. I just lay down on my back. And I could just see amber just falling on us. Like the sky had no stars. The amber was the stars. Red stars in the sky. That's what it looked like. Just a black sky with red stars just falling down. I was floating on the ocean, but I felt like I was floating in space. It's hard to describe because everything happened so fast. I was thanking God. I was like, thank you, thank you, thank you. I don't deserve this. It was just unbelievable that we made it. And Damon, he managed to make it. He managed to get out, get in the water. I don't know how. I don't even see him. But I remember they pulled him in. And I was like, thank God. We made it. And I said, oh, how did you guys find us? And they said, we got a call that someone might be on the harbor. So I thanked that lady. She relayed the call and finally got to us. And I said, thank God we made it. And he said, oh, no, not yet. We still have to go through the storm. And I said, where are we going? And he said, we don't know. Everything's on fire. And I looked behind me and it was just, it was just, it looked like, well, it was just war. It was just flames up to the sky. The whole, I mean, the whole town and the darkness. How long were you out there on the boat with him? Myself forever, but I think it was a couple of hours, something like that. And remember I was saying that the couple that came from the harbor, they had no shirts. Yeah. And the guy was like burnt everywhere and he had like blood oozing from his leg. It was pretty bad. And then the girl, it wasn't as bad. She came and she gave me a pair of underwear to like cover the smoke because we're still, there's still smoke out. See, you know, I was like, I don't want to put it on the wear on my nose. And I recognized it and it was my underwear. And I looked at her and she was wearing my shirt and my pair of shorts. And I said, where'd you get this? And she said, oh, I got it from the harbor. So then I had to be underwearing and I covered myself. Did you tell her? What did she say? Yeah. This is my shirt. I bought this in Vegas like 2016 and she had to cover herself. I get it. She was like in her bathing suit and it was burning. So she was wearing my clothes. This was all from your backpack? This is from my backpack. Yeah. The other one that I left there. Oh my gosh. And so we got to Maalea Harbor and there's a bunch of, you know, Coast Guard waiting for us. And then, you know, they grabbed us and made sure we got to land and they directed us through to a bus, a city bus. So where did the bus take you? To Maui High School. So they made a shelter there. And I mean, it was just a lot of people, the big TV and the news playing, everybody standing and looking. And then when we arrived, of course, we were like covered in suits and all black. So everyone was looking at us and I was barefoot. So people kept staring at my feet. Everybody knew, you know, we're the ones who survived. You know, everybody that was in the shelter or the lucky ones. So everybody was kind of quiet. It was a quiet night. And so we signed in with the Red Cross and I got examined by the nurse and she listened to one of my lungs and she said that my lung, you know, I need to get checked out and my hand as well. You know, she's like, wow, it's probably broken. And I got a blanket and I went and I found the corner of the gym, like all the way in the back. There was no one. And then I just went by myself and I just put my headphones on but I didn't have anything just to kind of stop the noise, the echoes. I needed to be alone. Could you see Damien? Damien was still eating. So he was doing pretty good. Was he talking to people? He was talking to everyone. Yeah, Damien is a, yeah, he's a genius. He's a genius. He's a genius. He's a genius. He's a genius. He's a genius. He's a genius. He's a genius. He's a genius. He's a, yeah, he's a chatter. And when he called me today, he's like, I'll never forget you. He was a little drunk and I guess he was coping with it. And, you know, he said that we were brothers for life now. Did you think that too? Yeah, I mean, me and him went through something that, you know, not a lot of people went through. So yeah, it was something I'll never forget. How long were you in the shelter? I was there for two days, almost three. Oh, wow. Yeah. And where are you now Idris? We are at a hotel. We just, we're just waiting. We don't know what's going on. So no one knows what they're going to do. I mean, I'm telling you, I don't even have shoes, you know, and I don't want to complain because I'm alive and I feel like I shouldn't be, you know, but I don't know what to feel right now. I feel lost. And I lost literally everything, everything I had and never get it back. And you know, I was down to like the last cabinets and I had just the curtains to put up in my room. And then I was done in my new place. Everything was brand new. I worked so hard, you know, to have what I have. And then to find out I was one week away from being insured and I lost everything. I was literally, I needed one more curtain from my bedroom and that's it. I was home. Yeah. I worked so hard. And then I feel guilty because I'm complaining about my position when people lost, you know, their loved ones. Yeah. You know, and I can't imagine what people went through with kids in their arms and grandma and had to, I don't know if I would have made it, you know, the panic to have to care for somebody else like that. You know, they found a couple hugging in their car burned down. You know, I can't imagine, I can't imagine what they went through. People with kids and my friend's grandmother, a retirement home burned down and they can't find her. I know friends of mine, their parents and relatives, you know, probably died and died for sure. And so what the hell happened? Like why, what happened? How it's not like, you know, Hawaii is known to have hurricanes. Like why weren't we ready? Like how is this possible with all this money from tourism coming in? Like, I don't understand how this could have happened. There is nothing, no warnings, no alarms, nothing at all. When you think about it now, how do you make sense of it? What I don't make sense of it. It just, it's still a miracle that I'm alive and it's still, I mean, you know, it's still like Pompeii. That's what it felt like, just raining fire and everybody burning and the sirens and then the wind, the explosions, no one knew where to go. But what's going to stick with me the most is definitely the screams and that dog when he looked at me in the water and the guy in the parking lot who was screaming, but I just didn't know what he was saying. Do you see those things when you close your eyes? I see them when my eyes are open. I'm lucky. I'm lucky. I'm one of the lucky ones. You know, I have to start from scratch. Okay, I'm lost, but thank God I'm alive. We'll be right back. So Mike, my colleagues and I at the Daily have been talking to survivors of the Hawaii fire and we just heard one of those stories from a man named Idris, a survivor. And at the end of our conversation, he had some questions that I think a lot of us have about how so many people could have died. You know, what went wrong? So you've been in Maui reporting and we wanted to ask you some of these questions. First I want to start with setting the table with a few things we do know, which is we know that the fire started around 630 in the morning, most likely from a downed power line that sparked on dry grass. And we also know that firefighters responded to that and around mid morning they declared it contained, but obviously it wasn't. So why don't you pick up from there, Mike? How did this essentially low grade brush fire turn into this monster? Yeah, I mean that day you had a real confluence of factors that set up the disaster. You had some really strong winds coming down the mountainside that a lot of people have attributed to a hurricane passing a few hundred miles to the south. You had a drought that had been in the region for quite some time. You had these really dry, invasive grasses, some non-native species that have been there since the island's plantation days or the aftermath of the plantation days. And you know, I think you really had this other factor of firefighters being stretched thin. This was a bad fire day across the island. They were strained across a few different places and didn't have their full capacity in Lahaina when things started getting out of control. And so early morning there was this fire up on the hillside, more than a mile above the commercial district, the front street area of Lahaina. They declare it contained and eventually start going off to do other things. But one of the neighbors I talked to said there was still just bits of smoke, like the ground was hot. That there was still just something smoldering there. And as the afternoon went on, the winds are roaring and all of a sudden the flames are back. And at that point, the winds are so strong that these little embers that are getting tossed into the air are soaring down the hillside. They're racing down the hillside. The winds are so fast that the fire starts to skip down and pretty soon it's just headed towards some of the densest housing neighborhoods in town. And the people we've talked to in that neighborhood said they essentially had no chance to prepare for evacuation, no warning that they should be getting out. The fire was on top of them so fast. Yeah, to that point, we heard from Idris and other people we talked to that there was no alarm, right? No warning. People didn't even know to get out until the fire was basically on their doorstep. Yeah, it's interesting because the community has these warning sirens throughout town and every month residents there get to hear them. They have this whirring horn sound. It's called an all hazard system. But the county is saying that it's really a system not designed for fire. It's designed for things like a tsunami. They felt like it was really not something that they had planned and considered to use in the event of a fire. I think a lot of people, a lot of the residents feel like this would have been the ideal circumstance to use it. Cell service was going down, electricity was getting knocked out when there's so many people sitting in their homes and they have no idea what's coming. Something that could jar them to awareness that they may soon be incinerated, I think would have been to a lot of people a big help. Okay, so once people realize the fire is a big problem and it's starting to roar into the town of Lahaina and they need to get out, what happens then? What do they do? A lot of people we talked to mentioned traffic jams. People on the same road gunning their engines trying to get out and getting stuck. Yeah, you know, I think it's important to know there's really only two roads in and out of town. And one of them, the fire was going across, it was closed off to the fire. The other, we know there were at different points power lines that had fallen across the road. And critically, you know, once they were on the roads, people had no way to pass them. They were waiting for crews to come clear the roads. You can see the traffic jams in some of the videos starting to build as people wait for a way to get south, a way to get north, a way to get anywhere out of town. And to make matters worse, you know, the fire crews are racing around and initially trying to slow the spread of the fire. But soon we were talking to some of them that they were tapping into hydrants and the stream was getting weaker. You know, the spray would come out and it would, the wind was so strong, it just turned to mist. And then by the time they got further down the hill, the hydrants are basically empty. The county now says that the fire had burned so much so fast that there were homes all over town leaking water and it left the firefighters with nothing to fight this fire. They were left watching the town burn with no way to stop it. And instead were forced into basically try and get people out of town, try and direct them. And even then they were down on Front Street, stuck there. And that's where things really just turned into a death trap. So Mike, hearing you talk about all of this and really lay out these problems, you know, clearly this was an extraordinarily unlucky series of events. You know, fire from a downed power line driven by hurricane-forced winds roars into this town. And because of other power lines that are down, the roads are closed. But also it sounds maybe like some of this could have been avoided. Like to what degree was this bad luck versus human error? I think there's certainly a sense that this confluence of factors would have been really hard to overcome, that this was going to be a serious and devastating situation, no matter how swift the response once the fire took hold. At the same time, we have a situation with a lot of missed opportunities to have slowed the spread of the fire and save more people. You know, there's already lawsuits against the electric company, challenging them on whether they should have cut off power before the fire even started, questions about the crews on the power lines and whether they could have done more to clear roads at the time when people were trying to escape. There's an investigation from the state attorney general that's exploring the overall wildfire and the response. The warning system, the preparations the county could have done, the resources available for the fire department. There's going to be a lot of questions for I think several years. But I think in the bigger picture, there's going to be a lot of questions about the future of West Maui in a place where so many people want to live. There's so many residents that want to be here, tourists that want to come. It's a special place with a deep history, former capital of the Hawaiian Kingdom. And these days, there's a strain on the resources. There's growing drought, there's growing winds, and there's a sense that the wildfire risk here is going to continue expanding as well. And it really raises some questions about the future of Lahaina at a time when right now this community kind of has to start from scratch. And prevent something with this much collective anguish from ever happening again. Absolutely. Mike, thank you. Sabrina, thank you. On Thursday, the chief of the Maui Emergency Management Agency resigned. The resignation of Herman Andaya, who cited health reasons for his departure, came one day after he defended not using outdoor sirens to warn about the fire. We'll be right back. Here's what else you should know today. On Thursday, the sheriff's office in Fulton County, Georgia said that it was investigating threats made online against grand jurors who voted to indict former President Donald Trump for conspiring to overturn the results of the state's 2020 election. Georgia requires that the jurors be named in the indictment. And soon after it was released on Monday, the jurors' identities began appearing on social media. Some jurors had their pictures, social media profiles, and possible addresses and phone numbers shared. In some cases, with the suggestion that they should be harassed. Today's episode was produced by Lindsay Garrison, Will Reed, and Sydney Harper. It was edited by Michael Benoit and Liz O'Balin, contains original music by Marian Lozano and Dan Powell, and was engineered by Alyssa Moxley. Special thanks to Nicholas Bogle Burroughs, Sean Hubler, Serge Koaleski, and Alain de la Carrière. Our theme music is by Jim Brunberg and Ben Landsberg of Wonderly. That's it for the daily. I'm Sabrina Tavernisi. See you on Monday."}, "podcast_summary": "In this episode of The Daily podcast from The New York Times, a survivor of the Maui wildfires shares their harrowing experience of fleeing the fire and the chaotic evacuation. The individual, Idris, recounts waking up to power outages and strong winds, unaware that a wildfire was approaching. He describes how quickly the fire spread and the panic that ensued as people tried to escape. The lack of warning systems and overwhelmed emergency responders added to the chaos. Ultimately, Idris and others were rescued by the Coast Guard and taken to a shelter. The episode raises questions about what went wrong and how such a tragedy could have been prevented. It highlights the need for better disaster preparedness and warning systems in the future.", "podcast_guest": "The podcast guest is Idris Noara, who is a(n) Survivor. The subject of this episode is Hawaii wildfires.", "podcast_highlights": "- Highlight 1: \"I have to get out of here.\"\n- Highlight 2: \"Everything was on fire.\"\n- Highlight 3: \"It felt like we were in hell.\"\n- Highlight 4: \"There was no warning, no alarms, nothing at all.\"\n- Highlight 5: \"I'm one of the lucky ones, but I feel lost.\""}